#+title: Week 5
#+description: Lists, Stacks, Queues

* Lists
** Intro
+ payload: value ðŸ™‚
+ node: contains payload ðŸ”³
+ linked list: head
*** Pointer
| 0 | 1 | 2 | 3 | 4 | 5 | 6 | ... |
*** Singly Linked
| 0 | -> | 1 | -> | 2 | -> | 3 | -> | ... |
#+begin_src cpp
class IntSLLNode {
public:
        IntSSLNode() {
                next = 0;
        }
        IntSLLNode(int i, IntSLLNode *in = 0) {
                info = i;
                next = in;
        }
        int getInfo() {
            return info;
        }
private:
        int info;
        IntSLLNode *next;
};

int main () {
    IntSLLNode head(99);
    std::cout << head->getInfo() << std::endl;
    return 0;
}
#+end_src
#+RESULTS:
:results:
:end:
**** DUMMY
+ always in list
+ list empty when both head and tail = dummy

*** Doubly Linked
| 0 | <-> | 1 | <-> | 2 | <-> | 3 | <-> | ... |
* Stacks
| ðŸ‘¨ |
| ðŸ¶ |
| ðŸ¸ |
| ðŸ˜œ |
|-----|
+ one-dimensional
+ LIFO: last in first out
** primitive/atomic actions
+ push: payload
+ pop: payload -> void
+ is_empty: bool
* Queues
** fifo
|----------+---+---+---+---+---+---+---+----------|
| back     |   |   |   |   |   |   |   | front    |
|----------+---+---+---+---+---+---+---+----------|
| ^ insert |   |   |   |   |   |   |   | ^ remove |
|----------+---+---+---+---+---+---+---+----------|
